DataProcessors/УправлениеЛицензированием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>УправлениеЛицензированием</Name>
			<Comment>Управление лицензированием</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Comment>Код ошибки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСтарта</Name>
					<Comment>Режим старта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Comment>Пин-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураОборудования</Name>
					<Comment>Сигнатура оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОборудования</Name>
					<Comment>Описание оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктивации</Name>
					<Comment>Вариант активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Электронная почта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветИнтернетАктивации</Name>
					<Comment>Ответ интернет активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтвет</Name>
					<Comment>Переключатель запрос или ответ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЗапросаТелефоннойАктивации</Name>
					<Comment>Строка запроса телефонной активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>58</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации1</Name>
					<Comment>Блок ответа телефонной активации 1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации2</Name>
					<Comment>Блок ответа телефонной активации 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации3</Name>
					<Comment>Блок ответа телефонной активации 3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьсяКВыбранномуСерверуПослеАктивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПакетаЛицензий</Name>
					<Comment>Регистрационный номер пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПакетаЛицензий</Name>
					<Comment>Пароль пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАктивации</Name>
					<Comment>Способ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКлюча</Name>
					<Comment>Номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерКлюча</Name>
					<Comment>Заводской номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установщик</Name>
					<Comment>Установщик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступаКлючаЗащиты</Name>
					<Comment>Код доступа ключа защиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеЛицензированием/Forms/ФормаАктивацииЛицензий/Ext/Form/Module.bsl
////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	КоличествоРешений = СписокРешений.Количество();
	
	Если КоличествоРешений > 1 Тогда // Несколько решений
		СписокВыбораРешений = Элементы.ВыбранноеРешение.СписокВыбора;
		ИндексРешения = 0;
		Для Каждого ЭлементСписка Из СписокРешений Цикл
			СписокВыбораРешений.Добавить(ИндексРешения, ЭлементСписка.Значение);
			ИндексРешения = ИндексРешения + 1;
		КонецЦикла;
	КонецЕсли;
	
	ВыбранноеРешение = 0;
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("РегистрационнаяИнформация",,,"");
	Если Не Настройки = Неопределено Тогда
		Для Каждого Настройка Из Настройки Цикл
			Объект[Настройка.Ключ] = Настройка.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбработкиПоИндексу(Индекс)
	СписокРешений = ЛицензированиеПоддержка.ПолучитьСписокРешений();
	ТекИндекс = 0;
	Для Каждого ЭлементСписка Из СписокРешений Цикл
		Если ТекИндекс = Индекс Тогда
			Возврат ЭлементСписка.Ключ;
		Иначе
			ТекИндекс = ТекИндекс + 1;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	//отключение видимости всех страниц
	Для Каждого ТекСтраница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		ТекСтраница.Видимость = Ложь;
	КонецЦикла;
	Если КоличествоРешений = 1 Тогда
		Объект.ИмяОбработки = ПолучитьИмяОбработкиПоИндексу(0);
		ПереходКСтранице(Элементы.СтраницаВыборСпособаАктивации);
	Иначе
		ПереходКСтранице(Элементы.СтраницаВыборРешения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СохранитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	Если РежимАктивации = 0 Тогда // для НЕ совместных продуктов
		Если СтрДлина(СокрЛП(Объект.РегистрационныйНомерПакетаЛицензий)) < 13 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Некорректно указан регистрационный номер!
			|Номер должен соджержать не менее 13 цифр";
			Сообщение.Поле = "Объект.РегистрационныйНомер";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(Объект.ПарольПакетаЛицензий,"-","")) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан пароль пакета лицензий!";
		Сообщение.Поле = "Объект.ПарольПакетаЛицензий";
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		Если (РежимАктивации = 0 И СтрДлина(СокрЛП(Объект.ПарольПакетаЛицензий)) < 15) ИЛИ (РежимАктивации = 1 И СтрДлина(СокрЛП(Объект.ПарольПакетаЛицензий)) < 39) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неверно указан пароль пакета лицензий!";
			Сообщение.Поле = "Объект.ПинКод";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаВперед(Команда)
	ОбработкаДействия("Вперед");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	ОбработкаДействия("Назад");
КонецПроцедуры

// Активация пакета лицензий через интернет
&НаКлиенте
Процедура КомандаАктивироватьВебСервис(Команда)
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	КодированнаяСтрока = СформироватьЗапросАктивации();
	Если КодированнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	Если ИмяМакетаПараметровЛицензирования = Неопределено Тогда
		ОписаниеОшибки = "Неверный формат имени обработки:"+Символы.ПС+Объект.ИмяОбработки;
		Сообщить(ОписаниеОшибки);
		Возврат;
	КонецЕсли;	
	
	Если РежимАктивации = 0 Тогда
		ОтветАктивации = ЛицензированиеСервер.АктивироватьЧерезВебСервис(КодированнаяСтрока, 1, ИмяМакетаПараметровЛицензирования, ОписаниеОшибки);
	Иначе
		ОтветАктивации = ЛицензированиеСервер.АктивироватьЧерезВебСервис(КодированнаяСтрока, 3, ИмяМакетаПараметровЛицензирования, ОписаниеОшибки);
	КонецЕсли;
		
	Если ОтветАктивации = "" Тогда
		Сообщить(ОписаниеОшибки);
	Иначе
		Результат = ЛицензированиеСервер.УстановитьОбновлениеКлюча(ОтветАктивации, ОписаниеОшибки);
		Если НЕ Результат Тогда
			Сообщить(ОписаниеОшибки);
		Иначе
			Закрыть("Пакет лицензий № " + Объект.РегистрационныйНомерПакетаЛицензий+ " активирован.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Активация пакета лицензий через файловый запрос
&НаКлиенте
Процедура КомандаАктивироватьВручную(Команда)
		
	Файл = Новый Файл(Объект.ОтветИнтернетАктивации);
	Если НЕ Файл.Существует() Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	Файл.ПолучитьТолькоЧтение();
	ПотокЧтения = Новый ТекстовыйДокумент();
	ПотокЧтения.Прочитать(Объект.ОтветИнтернетАктивации,КодировкаТекста.ANSI);
	ТекстОтвета = ПотокЧтения.ПолучитьТекст();
	
	Результат = ЛицензированиеСервер.УстановитьОбновлениеКлюча(ТекстОтвета, ОписаниеОшибки);
	Если НЕ Результат Тогда
		Сообщить(ОписаниеОшибки);
	Иначе
		Закрыть("Пакет лицензий № " + Объект.РегистрационныйНомерПакетаЛицензий+ " активирован.");
	КонецЕсли;
    	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьФайлЗапроса(Команда)
	
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	КодированнаяСтрока = СформироватьЗапросАктивации();
	Если КодированнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Сохранить файл запроса активации как";
	Диалог.Фильтр = "Файлы *.txt|*.txt";
	
	Если РежимАктивации = 0 Тогда
		Диалог.ПолноеИмяФайла = "LAR" + Объект.РегистрационныйНомерПакетаЛицензий + ".txt";
	Иначе
		ЧастьКода = СтрЗаменить(Лев(Объект.ПарольПакетаЛицензий, 7),"-","");
		Диалог.ПолноеИмяФайла = "LAR" + ЧастьКода + ".txt";
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Файл = Новый ТекстовыйДокумент();
	
	Попытка
		Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
	Исключение
		Сообщить("Не удалось сохранить файл запроса!");
	КонецПопытки;
	
	Файл.УстановитьТекст(КодированнаяСтрока);
	Попытка
		Файл.Записать(ИмяФайла, КодировкаТекста.ANSI);
		ФайлЗаписан = Истина;
	Исключение
		Сообщить("Не удалось сохранить файл запроса!");
	КонецПопытки;
	Если ФайлЗаписан Тогда
		ТекстПредупреждения = "Запрос активации пакета лицензий сохранён в файл: " + ИмяФайла +".
		|Отправьте этот файл по электронной почте на адрес """ + ЛицензированиеСервер.АдресЭлектроннойПочтыДляАктивации(ИмяМакетаПараметровЛицензирования) + """,
		|получите ответ и загрузите его на странице загрузки ответа активации пакета лицензий";
		Предупреждение(ТекстПредупреждения,,"Создан файл запроса активации пакета лицензий");
		
		ПереходКСтранице(Элементы.СтраницаОтветАктивации);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СформироватьЗапросАктивации()
	ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
	РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
	
	Результат = ПолучитьПараметрыКлюча(Объект.ИмяОбработки);
	
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстXML = Новый ЗаписьXML;
	ТекстXML.УстановитьСтроку();
	
	ТекстXML.ЗаписатьОбъявлениеXML();
	ТекстXML.ЗаписатьНачалоЭлемента("sd");
	
	ТекстXML.ЗаписатьНачалоЭлемента("Activation");
	
	Если РежимАктивации = 0 Тогда
		ТекстXML.ЗаписатьАтрибут("Type", "1");
		ТекстXML.ЗаписатьАтрибут("PinCode", Объект.ПинКод);
		ТекстXML.ЗаписатьАтрибут("KeyNumber", Формат(Объект.НомерКлюча,"ЧГ="));
		ТекстXML.ЗаписатьАтрибут("Regnumber", Объект.РегистрационныйНомерПакетаЛицензий);
		ТекстXML.ЗаписатьАтрибут("Password", Объект.ПарольПакетаЛицензий);
	Иначе
		ТекстXML.ЗаписатьАтрибут("Type", "3");
		ТекстXML.ЗаписатьАтрибут("PinCode", Объект.ПинКод);
		ТекстXML.ЗаписатьАтрибут("KeyNumber", Формат(Объект.НомерКлюча,"ЧГ="));
		ТекстXML.ЗаписатьАтрибут("Regnumber", "");
		ТекстXML.ЗаписатьАтрибут("Password", Объект.ПарольПакетаЛицензий);
	КонецЕсли;

	ТекстXML.ЗаписатьКонецЭлемента();
	
	ТекстXML.ЗаписатьНачалоЭлемента("RegInfo");
	
	ТекстXML.ЗаписатьАтрибут("Responsible", Объект.Ответственный);
	ТекстXML.ЗаписатьАтрибут("Organization", Объект.Организация);
	ТекстXML.ЗаписатьАтрибут("Phone", Объект.Телефон);
	ТекстXML.ЗаписатьАтрибут("email", Объект.ЭлектроннаяПочта);
	ТекстXML.ЗаписатьАтрибут("web", Объект.Сайт);
	ТекстXML.ЗаписатьАтрибут("installer", Объект.Установщик);
	
	ТекстXML.ЗаписатьКонецЭлемента();
	ТекстXML.ЗаписатьКонецЭлемента();
	
	СтрокаАктивации = ТекстXML.Закрыть();
		
    КодированнаяСтрока = "";
	ОписаниеОшибки="";
	
	Если НЕ ЛицензированиеСервер.КомпонентаЗакодироватьСтроку(СтрокаАктивации, КодированнаяСтрока, Объект.ИмяОбработки, ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;

	Возврат КодированнаяСтрока;
КонецФункции

// Получение параметров ключа защиты
&НаКлиенте
Функция ПолучитьПараметрыКлюча(ИмяОбработки)
	Перем ВсегоПользователейЗаМесто, СвободноПользователейЗаМесто, ВсегоПользователейЗаСессию, СвободноПользователейЗаСессию, Маска, Счетчик1, Счетчик2, Счетчик3, ДатаОкончания, ТипКлюча, СерийныйНомер, АппаратныйНомер, ПинКод, НазваниеКлюча;
	
	Результат = ЛицензированиеСервер.ПолучитьПараметрыКлючаЗащиты(ИмяОбработки, ВсегоПользователейЗаМесто, СвободноПользователейЗаМесто, ВсегоПользователейЗаСессию, СвободноПользователейЗаСессию,
	                                                              Маска, Счетчик1, Счетчик2, Счетчик3, ДатаОкончания, ТипКлюча, СерийныйНомер, АппаратныйНомер, ПинКод, НазваниеКлюча, ОписаниеОшибки, КодОшибки);
	Если НЕ Результат Тогда
		Возврат Ложь;
	Иначе
		Объект.НомерКлюча = СерийныйНомер;
		Объект.ЗаводскойНомерКлюча = АппаратныйНомер;
		Объект.ПинКод = ПинКод; // пин-код, которым был активирован ключ защиты
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаДействия(Действие)
	Страницы = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы;
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Страницы.СтраницаВыборСпособаАктивации Тогда
		Если Объект.СпособАктивации = 0 Тогда //веб сервис
			ПереходКСтранице(Страницы.СтраницаАнкетныеДанные);
		Иначе
			//вручную
			ПереходКСтранице(Страницы.СтраницаЗапросОтвет);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаВыборРешения Тогда
		Объект.ИмяОбработки = ПолучитьИмяОбработкиПоИндексу(ВыбранноеРешение);
		ПереходКСтранице(Страницы.СтраницаВыборСпособаАктивации);
		
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаАнкетныеДанные Тогда
		Если Действие = "Вперед" Тогда
			
			Если НЕ ПроверитьЗаполнение() Тогда
				Возврат;
			КонецЕсли;
			
			Если Объект.СпособАктивации = 0 Тогда
				ПереходКСтранице(Страницы.СтраницаАктивацияВебСервис);
				Элементы.КомандаСохранитьФайлЗапроса.Видимость = Ложь;
				Элементы.КомандаАктивироватьВебСервис.Видимость = Истина;
			Иначе
				ПереходКСтранице(Страницы.СтраницаАктивацияВебСервис);
				Элементы.КомандаСохранитьФайлЗапроса.Видимость = Истина;
				Элементы.КомандаАктивироватьВебСервис.Видимость = Ложь;
			КонецЕсли;
		Иначе //Назад
			ПереходКСтранице(Страницы.СтраницаВыборСпособаАктивации);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаЗапросОтвет Тогда
		Если Действие = "Вперед" Тогда
			Если Объект.ЗапросОтвет = 0 Тогда
				ПереходКСтранице(Страницы.СтраницаАнкетныеДанные);
			Иначе
				//Ответ активации
				ПереходКСтранице(Страницы.СтраницаОтветАктивации);
			КонецЕсли;
		Иначе
			//Назад
			ПереходКСтранице(Страницы.СтраницаВыборСпособаАктивации);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаАктивацияВебСервис Тогда	
		Если Действие = "Назад" Тогда
			ПереходКСтранице(Страницы.СтраницаАнкетныеДанные);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Страницы.СтраницаОтветАктивации Тогда
		Если Действие = "Назад" Тогда
			Если Объект.СпособАктивации = 0 Тогда
				ПереходКСтранице(Страницы.СтраницаАнкетныеДанные);
			Иначе
				Если Объект.ЗапросОтвет = 0 Тогда
					ПереходКСтранице(Страницы.СтраницаАнкетныеДанные); 
				Иначе
					ПереходКСтранице(Страницы.СтраницаЗапросОтвет);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереходКСтранице(Страница)
	Элементы.ГруппаСтраницы.ТекущаяСтраница.Видимость = Ложь;
	Страница.Видимость = Истина;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если (Страница = Элементы.СтраницаВыборСпособаАктивации И КоличествоРешений = 1) ИЛИ Страница = Элементы.СтраницаВыборРешения Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаНазад.Доступность = Ложь;
	Иначе
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаКомандаНазад.Доступность = Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаАктивацияВебСервис ИЛИ ТекущаяСтраница = Элементы.СтраницаОтветАктивации Тогда
		Элементы.ФормаКомандаВперед.Доступность = Ложь;
	Иначе
		Элементы.ФормаКомандаВперед.Доступность = Истина;
	КонецЕсли;
	
	Если Страница = Элементы.СтраницаАнкетныеДанные Тогда
		ИмяМакетаПараметровЛицензирования = ЛицензированиеСервер.ПолучитьИмяМакетаПараметровЛицензирования(Объект.ИмяОбработки);
		РежимАктивации = ЛицензированиеСервер.РежимАктивации(ИмяМакетаПараметровЛицензирования);
		
		Если РежимАктивации = 0 Тогда
			Элементы.ПарольПакетаЛицензий.Маска = "999-999-999-999";
			Элементы.РегистрационныйНомер.Видимость = Истина;
			Элементы.РегистрационныйНомерВебСервис.Видимость = Истина;
		Иначе
			// совместные продукты
			Элементы.ПарольПакетаЛицензий.Маска = "999-999-999-999-999-999-999-999-999-999";
			Элементы.РегистрационныйНомер.Видимость = Ложь;
			Элементы.РегистрационныйНомерВебСервис.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветИнтернетАктивацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
		ВыборФайла.Фильтр = НСтр("ru = 'Текстовый документ(*.txt)|*.txt|Все файлы (*.*)|*.*'");
		ВыборФайла.ИндексФильтра = 0;
		Результат = ВыборФайла.Выбрать();
		ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
		
		Если НЕ Результат Тогда
			Возврат;
		КонецЕсли;
		
		Объект.ОтветИнтернетАктивации = ПолноеИмяФайла;
	Иначе
		ОписаниеОшибки = "Ошибка открытия файла. Попробуйте открыть через тонкий или толстый клиент.";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	ОписаниеНастройки = Новый ОписаниеНастроек;
	ОписаниеНастройки.Представление = "Регистрационная информация";
	ДанныеНастройки = Новый Структура("Организация, Ответственный, Телефон, ЭлектроннаяПочта, Сайт, Установщик", Объект.Организация, Объект.Ответственный, Объект.Телефон, Объект.ЭлектроннаяПочта, Объект.Сайт, Объект.Установщик);
	ХранилищеОбщихНастроек.Сохранить("РегистрационнаяИнформация",,ДанныеНастройки,,"");
КонецПроцедуры
